Repository: pwsafe/pwsafe
Catalog: Misc/I18N/ru/omegat_help/omegat/project_save.tmx
Source language: en_us
Languages: ru_ru

source: When a Named Password Policy is selected, you may use the Edit button to change its values and the following dialog is shown.
ru_ru: Для редактирования параметров выберите требуемую именованную политику и нажмите кнопку «Правка». Будет отображён показанный ниже диалог.

source: When a database is exported to XML (whether it is a specific subset of the entries in the database or the whole database), all the Named Password Policies in the current database are also exported.
ru_ru: При экспорте контейнера в XML (всех записей или их подмножества) также экспортируются все именованные политики, хранящиеся в данном контейнере.

source: When a filter is active, the number of entries shown compared to the total number in the database is shown in the Status Bar and a small red and white box () appears in the far right of that bar.
ru_ru: Когда фильтр активен, в строке состояния отображается количество показанных элементов и, в скобках, общее количество элементов контейнера. Кроме того, в правом углу появляется значок ().

source: When a user changes the configuration to a non-default value, the new value is store by Password Safe.
ru_ru: Когда пользователь изменяет ту или иную настройку, её новое значение (отличное от значения по умолчанию) сохраняется.

source: When a user changes the configuration to a non-default value, the new value is store by PasswordSafe.
ru_ru: Когда пользователь изменяет ту или иную настройку, её новое значение (отличное от значения по умолчанию) сохраняется.

source: When a whole or subset of a database is merged into the current database, any Named Password Policy referenced by the entries being merged will be brought across from the source database.
ru_ru: При слиянии двух контейнеров (целиком или частично) связанные с добавляемыми элементами именованные политики будут взяты из контейнера-источника.

source: When all entries have been selected, Password Safe will cycle back to the first.
ru_ru: После того, как все элементы будут пройдены, Password Safe перейдёт на первый найденный элемент.

source: When an entry is selected, Edit the selected user name and password.
ru_ru: Если выбран элемент, открывает диалог редактирования текущей записи.

source: When an entry is selected, and the entry has a URL associated with it, then this will invoke the default browser to the URL.
ru_ru: Если для текущего элемента указана ссылка, открывает её в браузере по умолчанию.

source: When an entry is selected, this allows you to create a reference to the entry, typically in another group.
ru_ru: Если выбран элемент, позволяет создать ссылку на этот элемент (обычно в другой группе).

source: When an entry is selected, this will delete it.
ru_ru: Если выбран элемент, он будет удалён.

source: When an entry is selected, this will delete it. When a Group is selected (in Tree view), this will delete all entries under the selected group.
ru_ru: Удаление выбранного элемента. Если при древовидном просмотре выбрана группа, будут удалены все элементы, входящие в группу.

source: When an entry is set to be the alias of another entry, the alias's password effectively "follows" that entry's password: If you copy the alias' password to the clipboard, the password that gets copied is the base's.
ru_ru: Если элемент является псевдонимом для другого, его пароль совпадает с исходным. Так, при копировании в буфер обмен пароля псевдонима, туда будет помещён пароль исходного элемента.

source: When changing to read-write, you will be prompted for the master password.
ru_ru: При переключение в режим «чтение/запись» будет запрошен мастер-пароль.

source: When checked, Esc can be used to close Password Safe when the program is maximized.
ru_ru: Если помечено, клавиша Esc закрывает Password Safe.

source: When checked, Password Safe records the time each entry was accessed (e.g., when the password was copied, or when the entry's details were viewed, etc.).
ru_ru: Если помечено, Password Safe будет записывать время доступа к элементу (копирование пароля, просмотр данных элемента и пр.).

source: When checked, Password Safe saves all changes made to a password entry immediately, without waiting for the user to use Save or Save As and without confirmation.
ru_ru: Если помечено, Password Safe будет сохранять все изменения не дожидаясь того, что пользователь нажмёт Сохранить или Сохранить как.

source: When checked, Password Safe will copy the database before each save.
ru_ru: Если помечено, Password Safe будет копировать контейнер перед каждым сохранением.

source: When checked, a prompt is displayed requesting user confirmation every time a password is copied from the database to the clipboard.
ru_ru: Если помечено, Password Safe каждый раз будет запрашивать разрешение на копирование пароля в буфер обмена.

source: When checked, a user prompt requesting confirmation will be displayed every time you try to delete a password entry.
ru_ru: Если помечено, при удалении элемента будет выводится запрос подтверждения.

source: When checked, locks the password database when the program is minimized.
ru_ru: Если помечено, при сворачивании программы контейнер будет блокироваться.

source: When checked, passwords will include those characters that represent hexadecimal digits only.
ru_ru: Если флажок установлен, будут использованы только символы, представляющие шестнадцатеричные цифры.

source: When checked, pressing the keys in the sequence to the right will restore Password Safe from the system tray, if minimized, or bring it to the front, if obscured by other applications.
ru_ru: Если выбрано, указанная комбинация клавиш будет использована для восстановления Password Safe из скрытого состояния, или помещения его окна на передний план, когда оно перекрыто другими окнами.

source: When checked, pressing the keys in the sequence to the right will restore PasswordSafe from the system tray, if minimized, or bring it to the front, if obscured by other applications.
ru_ru: Если помечено, указанная комбинация клавиш будет использована для восстановления Password Safe из скрытого состояния, или помещения его окна на передний план, когда оно перекрыто другими окнами.

source: When checked, the program clears clipboard contents of any stored data (such as a password) when the application is minimized.
ru_ru: Если помечено, при сворачивании окна программы будет произведена очистка буфера от данных, помещённых туда Password Safe (например, имя пользователя, пароль и пр.).

source: When checked, the program clears clipboard contents of any stored data (such as a password) when the interface is minimized or closed.
ru_ru: Если помечено, при закрытии окна программы будет произведена очистка буфера от данных, помещённых туда Password Safe (например, имя пользователя, пароль и пр.).

source: When checked, the program locks the password database when the application is minimized.
ru_ru: Если помечено, при сворачивании программы контейнер будет блокироваться.

source: When exporting a single entry:
ru_ru: При экспорте одного элемента:

source: When exporting data, you may use the 'Advanced' feature to exclude any number of these fields from the Title Row and records.
ru_ru: С помощью расширенных настроек экспорта можно исключить ненужные поля из заголовка и экспортируемых записей.

source: When exporting data, you may use the “Advanced” feature to exclude any number of these fields from the Title Row and records.
ru_ru: С помощью расширенных настроек экспорта можно исключить ненужные поля из заголовка и экспортируемых записей.

source: When exporting only members of a group or the results of the current filter, if any of the included entries are aliases or shortcuts, then the associated base entries will also be exported even if it is not in the group or filtered results.
ru_ru: Если в экспортируемой группе или результатах отбора по фильтру присутствуют ярлыки или ссылки, то соответствующие исходные элементы будут экспортированы, даже если они не входят в эту группу или результаты отбора.

source: When exporting to a Text file, the name of any referenced Named Password Policy is also exported.
ru_ru: Имена связанных политик также экспортируются в простой текстовый файл.

source: When exporting to a Text file, the name of of any referenced Named Password Policy is also exported.
ru_ru: Имена связанных политик также экспортируются в простой текстовый файл.

source: When exporting to a plain text file, this character is also used to replace a dot (.) in a Title field so that the correct Tree structure is rebuilt on Import (note a dot is used to separate groups).
ru_ru: При экспорте в простой текст этот символ также используется для замены точек (.) в заголовке. Это сделано для того, чтобы при импорте можно было восстановить разбиение на группы, т. к. точка используется для отделения групп.

source: When exporting to a plain text file, this character is also used to replace a period (.) in a Title field so that the correct Tree structure is rebuilt on Import (Note: a period is used to separate groups).
ru_ru: При экспорте в простой текст этот символ также используется для замены точек (.) в заголовке. Это сделано для того, чтобы при импорте можно было восстановить разбиение на группы, т. к. точка используется для отделения групп.

source: When importing XML into an empty database, any database preferences in the beginning of the XML input file will be imported into the database.
ru_ru: При импорте из XML-файла в пустой контейнер, в него также будут импортированы настройки контейнера.

source: When importing a XML file, if the any record references a Named Password Policy that does not exist in the current database (or in the XML file being imported), then the entry will be changed to use the current database default policy.
ru_ru: Все импортируемые записи, ссылающиеся на политику, отсутствующую в текущем контейнере или импортируемом XML-файле, будут привязаны к политике по умолчанию из текущего контейнера.

source: When increasing this value, consider the slowest CPU that you will use to access the database.
ru_ru: При увеличении этого значения учитывайте самый медленный компьютер, на котором будет использоваться данный контейнер.

source: When maximized again for use, a password is required to access the database.
ru_ru: Для доступа к контейнеру после открытия окна нужно будет ввести мастер-пароль.

source: When maximized again for use, a password is required to access the program.
ru_ru: Для доступа к контейнеру после открытия окна нужно будет ввести мастер-пароль.

source: When performing an Export of the current database to a clear Text or XML file, you must provide the name of the file to create or overwrite (you will be asked to confirm if you wish to replace an existing file).
ru_ru: При экспорте текущего контейнера в простой текст или XML требуется указать имя файла, в который будут записаны данные (если указанный файл существует, будет выдан запрос подтверждения перезаписи).

source: When performing the database Compare, Merge or Synchronize function, you must provide the name of the database that you wish to Compare with the currently open database, Merge into the currently open database or Synchronize with the currently open database.
ru_ru: При сравнении (слиянии, синхронизации) контейнеров требуется указать имя контейнера, который нужно сравнить (объединить, синхронизировать) с открытым в настоящий момент контейнером.

source: When presented with the Open dialog, you may specify to open an existing database in Read/Write of Read-Only mode.
ru_ru: При открытии файла можно указать режим «только чтение» или «чтение/запись».

source: When selected via the "Wizard Select Database or File" page, you will be given the option to restrict the Compare, Merge, Synchronize or Export based on your selected criteria.
ru_ru: Чтобы задать ограничения сравнения, слияния, синхронизации или экспорта, вы можете установить флажок «Расширенные условия отбора» на первой странице мастера.

source: When selected via the Advanced button on the Find Toolbar, you will be given the option to restrict the search based on your selected criteria.
ru_ru: Нажав на панели поиска кнопку «Расширенные», вы сможете задать условия, ограничивающие поиск.

source: When the application is restored, the user is presented with the opening dialog box (This option is meant for starting the application upon login, via a shortcut in the user's Startup folder).
ru_ru: При разворачивании окна будет выведен диалог открытия контейнера (параметр предназначен для запуска Password Safe через ярлык в меню автозапуска).

source: When the application is unminimized, the user is presented with the opening dialog box (This option is meant for starting the application upon login, via a shortcut in the user's Startup folder).
ru_ru: При разворачивании окна будет выведен диалог открытия контейнера (параметр предназначен для запуска Password Safe через ярлык в меню автозапуска).

source: When the database is closed, the ID is free to be assigned to another open database.
ru_ru: После закрытия контейнера идентификатор освобождается, и может быть назначен другому открытому контейнеру.

source: When the database is locked due to one of the events below, the database is saved, and then all its data is cleared from memory.
ru_ru: Если контейнер блокируется по одной из указанных ниже причин, контейнер сохраняется, и все его данные удаляются из памяти.

source: When the database is opened in read-only mode, access times are not updated.
ru_ru: Если контейнер открыт в режиме «только чтение», время последнего доступа не обновляется.

source: When the database is opened in read-only mode, the access times are not updated.
ru_ru: Если контейнер открыт в режиме «только чтение», время последнего доступа не обновляется.

source: When the database's default policy is selected, you may use the Edit button to change its values.
ru_ru: Чтобы отредактировать параметры политики по умолчанию, выберите ёё в списке и нажмите кнопку «Правка».

source: When the exiration date approaches, Password Safe will notify you upon startup that the password should be changed, as well as marking the entry in a distinct color.
ru_ru: При наступлении указанной даты Password Safe при запуске выведет уведомление и пометит элемент другим цветом.

source: When the expiration date approaches, Password Safe will notify you upon startup that the password should be changed, as well as marking the entry in a distinct color.
ru_ru: Незадолго до наступления указанной даты Password Safe при запуске выведет уведомление и пометит элемент другим цветом.

source: When the original database is opened again, Password Safe will check for the existence of any Failsafe Backup file and, if found, will display a dialog similar to that below.
ru_ru: При следующем открытии исходного контейнера Password Safe проверит наличие аварийных резервных копий и, в случае обнаружения, выведет похожий на приведённый ниже диалог:

source: When the original database is opened again, PasswordSafe will check for the existence of any Failsafe Backup file and, if found, will display a dialog similar to that below.
ru_ru: При следующем открытии исходного контейнера Password Safe проверит наличие аварийных резервных копий и, в случай наличия, выведет похожий на приведённый ниже диалог:

source: When this is enabled, the database will be modified even when no entry was edited.
ru_ru: В данном случае контейнер будет изменяться даже если элементы не редактировались.

source: When this is used, enabling "Create intermediate backups" is recommended, as this helps protect against disk problems.
ru_ru: При использовании данного параметра также рекомендуется включить «Создавать копию (.ibak) перед сохранением», чтобы предотвратить возможные повреждения, вызванные проблемами с диском.

source: When this option is selected, Password Safe will switch to a Secure Desktop whenever the master passphrase ("Safe Combination") need to be entered.
ru_ru: Если включено, Password Safe будет переключаться на «Защищённый рабочий стол» при запросе мастер-пароля.

source: When this option is selected, all the groups will be displayed first (in alphabetical order), followed by all top-level entries.
ru_ru: Если данная опция активна, группы будут расположены вверху (в алфавитном порядке), а за ними пойдут остальные элементы соответствующего уровня.

source: When to warn on about-to-expire passwords
ru_ru: Предупреждение о сроке истечения паролей

source: When you change an entry's password, Password Safe can record the previous passwords associated with the entry.
ru_ru: При изменении пароля элемента Password Safe может сохранять предыдущее значение.

source: When you click on the Yubikey button, the "Click, then activate your YubiKey" will be replaced by a progress bar indicating the remaining time you have to activate your YubiKey (by touching the flashing green light on the device).
ru_ru: После нажатия на кнопку с надписью YubiKey, текст «Нажмите на кнопку и коснитесь YubiKey» изменится на индикатор, показывающий оставшееся время, в течение которого вы должны активировать YubiKey прикоснувшись к «кнопке» на устройстве (мигающий зелёный огонёк).

source: When you clisk on the Yubikey button, the "Click, then activate your YubiKey" will be replaced by a progress bar indicating the remaining time you have to activate your YubiKey (by touching the flashing green light on the device).
ru_ru: После нажатия на кнопку с надписью YubiKey, текст «Нажмите на кнопку и коснитесь YubiKey» изменится на индикатор, показывающий оставшееся время, в течение которого вы должны активировать YubiKey прикоснувшись к «кнопке» на устройстве (мигающий зелёный огонёк).

source: When you do, consider renaming the original first or save the Failsafe Backup with a completely new name.
ru_ru: Возможно, перед этим стоит переименовать исходный контейнер, или сохранить аварийную резервную копию под другим именем.

source: When you release the left mouse button, the contents of the Notes field will be pasted to the application.
ru_ru: Когда вы отпустите левую кнопку мыши, содержимое заметок будет вставлено в выбранное поле того приложения.

source: When you release the left mousebutton, the contents of the Notes field will be pasted to the application.
ru_ru: Когда вы отпустите левую кнопку мыши, содержимое заметок будет вставлено в выбранное поле того приложения.

source: When you save such a database, you will be alerted of the fact that the new database will be unreadable by previous version of Password Safe.
ru_ru: При сохранении такой контейнер будет обновлён до текущего формата, и перестанет распознаваться предыдущими версиями Password Safe.

source: When you save such a database, you will be alerted to the fact that the new database will be unreadable by previous version of Password Safe.
ru_ru: При сохранении такой контейнер будет обновлён до текущего формата, и перестанет распознаваться предыдущими версиями Password Safe.

source: Where "name" was any of our record date/time fields e.g. 'ctime', 'atime', 'xtime', 'pmtime', 'rmtime' and the password history 'changed' date/time.
ru_ru: Где«name» — любое из имён полей, содержащих дату/время («ctime», «atime», «xtime», «pmtime», «rmtime», «changed»).

source: Where stored
ru_ru: Где хранится

source: Where we have changed the "name" to distinguish the fields from the old format by appending an 'x' and so 'namex' is any of our new record date/time fields e.g. 'ctimex', 'atimex', 'xtimex', 'pmtimex', 'rmtimex' and the password history 'changedx' date/time.
ru_ru: Для того, чтобы можно было отличить теги, записанные в «старом» стиле от «новых», к их именам был добавлен суффикс «x» («ctimex», «atimex», «xtimex», «pmtimex», «rmtimex», «changedx»).

source: Whether the answer is one or hundreds, Password Safe allows you to safely and easily create a secured and encrypted master password list.
ru_ru: Независимо от того, будет вашим ответом «один» или «сотни», с помощью Password Safe вы легко создадите защищённый зашифрованный список паролей.

source: Whilst it is possible to add more than this limit when the entry is added, warnings will be issued when the database is re-opened.
ru_ru: При создании элемента в это поле можно записать текст большего размера, но при открытии контейнера будет выводиться предупреждение.

source: Whilst the latest MSXML version is V6, V4 is normally installed on all versions of Windows supported by Password Safe.
ru_ru: Текущая версия MSXML V6, но V4 обычно присутствует на всех версиях Windows, поддерживаемых Password Safe.

source: Whilst the selected function (Compare, Merge, Synchronize or Export) is in progres, this page will show either the database being used (Compare, Merge and Synchronize) or the file being written to (Export to Text or XML).
ru_ru: Во время работы выбранной функции (сравнение, слияние, синхронизация или экспорт) на данной странице отображается используемый контейнер (сравнение, слияние, синхронизация) или файл, в который происходит запись (экспорт в простой текст или XML).

source: Whilst the selected function (Compare, Merge, Synchronize or Export) is in progress, this page will show either the database being used (Compare, Merge and Synchronize) or the file being written to (Export to Text or XML).
ru_ru: Во время работы выбранной функции (сравнение, слияние, синхронизация или экспорт) на данной странице отображается используемый контейнер (сравнение, слияние, синхронизация) или файл, в который происходит запись (экспорт в простой текст или XML).

source: Whilst we have made every effort to verify any preference we read in, we cannot guarantee that manually edited values will not cause a problem.
ru_ru: Несмотря на то, что значения настроек проверяются при чтении, мы не можем гарантировать, что параметры, заданные вручную, не вызовут проблем.

source: Window Transparency
ru_ru: Прозрачность окна

source: With a single click, the user name and password are entered and the data is submitted to the host for approval.
ru_ru: Нажатия одной кнопки достаточно, чтобы заполнить поля для ввода имени пользователя и пароля и произвести вход.

source: With this option, you can determine by site policy who will have write-access to a given database.
ru_ru: С её помощью вы сможете сами выбрать, кто должен иметь права на запись.

source: Wizard Advanced
ru_ru: Мастер: расширенные настройки

source: Wizard Finish
ru_ru: Завершение работы мастера

source: Wizard Select Database or File
ru_ru: Мастер выбора файла или контейнера

source: Word Wrap Notes in Add & Edit
ru_ru: При редактировании переносить заметки по словам

source: XML (eXtensible Markup Language) is a popular format for transferring data between applications.
ru_ru: XML (eXtensible Markup Language) — распространённый формат для передачи данных между приложениями.

source: XML and Text Import/Export
ru_ru: Экспорт/импорт в XML и простой текст

source: XML format
ru_ru: XML формат

source: You can also List the entries referencing a Named Password Policy by clicking on the List button and then go back to its details by clicking on the Details button.
ru_ru: Для получения списка элементов, использующих данную политику нажмите кнопку «Список» (для возврата к списку параметров нажмите кнопку «Информация»).

source: You can also expand or collapse all the groups displayed in the Nested Tree view, display subsets of the entries, filter the entries displayed to match any criteria, select the font in which the entries are displayed and display reports of merge, compare, import and other advanced operations.
ru_ru: Кроме того, вы можете свернуть или развернуть все группы в дереве, выбрать подмножества элементов, отфильтровать их по какому-либо условию, выбрать шрифт для отображения элементов или просмотреть отчёты о сложных операциях, таких как слияние, сравнение, импорт.
